# Dropping columns and rows in Pandas

### Imports

In [1]:
% matplotlib inline
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

### Creating the Dataframe

In [2]:
data = {"games" : list("ABCDE"),
       "players" : ["John", "Thomas","Chritie","Alex", "Jack"],
       "scores" : [23,34,12,73,23]}

df = pd.DataFrame(data, index = np.arange(5))

df

  games  players  scores
0     A     John      23
1     B   Thomas      34
2     C  Chritie      12
3     D     Alex      73
4     E     Jack      23

In [3]:
df.set_index("games", inplace=True)
df

       players  scores
games
A         John      23
B       Thomas      34
C      Chritie      12
D         Alex      73
E         Jack      23

### Dropping certain rows based on their label

In [4]:
df.drop(["A","C"])

      players  scores
games
B      Thomas      34
D        Alex      73
E        Jack      23

### Dropping the first three rows

In [5]:
df

       players  scores
games
A         John      23
B       Thomas      34
C      Chritie      12
D         Alex      73
E         Jack      23

In [6]:
df.drop(df.index[:3])

      players  scores
games
D        Alex      73
E        Jack      23

### Dropping columns (axis = 1)

In [7]:
df.reset_index("games",inplace= True)
df

  games  players  scores
0     A     John      23
1     B   Thomas      34
2     C  Chritie      12
3     D     Alex      73
4     E     Jack      23

In [8]:
df.drop(["games","scores"], axis = 1)  # by default axis = 0, so need to specify

   players
0     John
1   Thomas
2  Chritie
3     Alex
4     Jack

In [9]:
df.drop(df.columns[:2], axis = 1)

   scores
0      23
1      34
2      12
3      73
4      23